БухЭксп/Enums/ТипыЭлементовРегламентаЭДО.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ТипыЭлементовРегламентаЭДО</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ВложениеЕИС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДопСведенияПоРезультатамПриемки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДопСведенияПоРезультатамПриемки_ИОП</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДопСведенияПоРезультатамПриемки_ПДО</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДопСведенияПоРезультатамПриемки_ПДП</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИнформацияОтправителя</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИнформацияПолучателя</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИнформацияПолучателя_ИОП</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИнформацияПолучателя_ПДО</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИнформацияПолучателя_ПДП</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИнформацияПолучателя_ПДП_ИОП</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИОП</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИОП_ПДО</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИОП_ПДП</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИОП_ПДП_ИОП</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КвитанцияЕИС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КонтрактЕИС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Ошибка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОшибкаЕИС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПДО</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПДО_ИОП</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПДП</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПДП_ИОП</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПОА</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПОА_УОУ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПриложениеУКДДляЕИС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПриложениеУКДПокупателяДляЕИС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПриложениеУПДДляЕИС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПриложениеУПДПокупателяДляЕИС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УдалитьАктЗаказчик</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УдалитьДИСУКД</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УдалитьДОП</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УдалитьДополнительныйЭД</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УдалитьДОПУПД</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УдалитьИнформацияПокупателяУКД</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УдалитьИнформацияПокупателяУПД</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УдалитьИПЭСФ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УдалитьКСЧФДИСУКД</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УдалитьКСЧФУКД</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УдалитьПДОЭСФ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УдалитьПДПЭСФ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УдалитьПервичныйЭД</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УдалитьСоглашениеОбИзмененииСтоимостиПолучатель</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УдалитьСЧФДОПУПД</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УдалитьСЧФУПД</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УдалитьТОРГ12Покупатель</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УдалитьУУЭСФ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УдалитьЭСФ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УОПУ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УОУ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УОУ_ИОП</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УОУ_ПДО</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УОУ_ПДП</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЭДФ_ОткФщ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЭДФ_Титул1</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЭДФ_Титул1_ИОП</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЭДФ_Титул2</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЭЗЗ_Титул1</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЭЗЗ_Титул2</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЭЗН_ОткФщ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЭЗН_Титул1</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЭЗН_Титул1_ИОП</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЭЗН_Титул2</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЭЗН_Титул3</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЭЗН_Титул4</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЭПЛ_ОткМ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЭПЛ_Титул1</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЭПЛ_Титул2</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЭПЛ_Титул3</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЭПЛ_Титул4</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЭПЛ_Титул5</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЭПЛ_Титул6</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЭСВ_Титул1_1</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЭСВ_Титул1_2</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЭСВ_Титул1_3</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЭСВ_Титул1_4</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЭСВ_Титул1_5</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЭСВ_Титул2_1</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЭСВ_Титул2_2</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЭСВ_Титул3_1</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЭСВ_Титул3_2</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЭТрН_ДопТитул3</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЭТрН_ДопТитул4</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЭТрН_ДопТитул7</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЭТрН_ДопТитул8</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЭТрН_ДопТитул9</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЭТрН_ОткГО</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЭТрН_ОткП</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЭТрН_ОткТ3</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЭТрН_Титул1</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЭТрН_Титул1_ИОП</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЭТрН_Титул2</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЭТрН_Титул3</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЭТрН_Титул3_ИОП</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЭТрН_Титул4</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЭТрН_Титул5</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЭТрН_Титул5_ИОП</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЭТрН_Титул6</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЭТрН_Титул7</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЭТрН_Титул8</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЭТрН_Титул9</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УС_ИОП</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УС_УОУ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УС_ОтказВПодписи</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УС_ДополнительнаяИнформация</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УС_ОтзывЧерновика</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УС_ОтправленДокументПоЧерновику</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЭПЭ_Титул1</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЭПЭ_Титул2</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЭПЭ_Титул3</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЭЭР_Титул1</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЭСР_Титул1</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

БухЭксп/Enums/ТипыРегламентовЭДО.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ТипыРегламентовЭДО</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>АктОРасхождениях</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УПД</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Формализованный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ФормализованныйАктСверки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Неформализованный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЭТрН</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЭЗН</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЭСВ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЭЗЗ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЭПЛ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЭДФ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Черновик</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЭПЭ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЭЭР</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЭСР</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

БухЭксп/Enums/ДействияПоЭДО.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ДействияПоЭДО</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Аннулировать</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВернутьВРаботу</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Загрузить</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗагрузитьПриглашения</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗакрытьПринудительно</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отклонить</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтклонитьАннулирование</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтклонитьПодписание</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтменитьОтправку</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отправить</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтправитьВАрхив</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтправитьПовторно</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Перенаправить</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Переформировать</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПодготовитьКОтправке</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Подписать</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПринятьАннулирование</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СнятьСУтверждения</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Сформировать</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СформироватьИзвещение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СформироватьИсправление</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СформироватьОтвет</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Утвердить</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПринятьПриглашения</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗапроситьУточнение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СформироватьДополнительнуюИнформацию</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СоздатьДокументПоЧерновику</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

БухЭксп/CommonModules/ЧерновикиЭДО/Ext/Module.bsl
// @strict-types

#Область СлужебныйПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

#Область ТранспортныеКонтейнерыЭДО

// См. ТранспортныеКонтейнерыЭДО.ПриФормированииТаблицыТиповЭлементовРегламента
Процедура ПриФормированииТаблицыТиповЭлементовРегламента(Таблица) Экспорт
	НоваяСтрока = Таблица.Добавить();
	НоваяСтрока.КодТранзакции = "Template";
	НоваяСтрока.ТипЭлементаРегламента = Перечисления.ТипыЭлементовРегламентаЭДО.ИнформацияОтправителя;
КонецПроцедуры

// См. ТранспортныеКонтейнерыЭДО.ПриФормированииТаблицыТиповРегламентов
Процедура ПриФормированииТаблицыТиповРегламентов(Таблица) Экспорт
	НоваяСтрока = Таблица.Добавить();
	НоваяСтрока.КодРегламента = "Template";
	НоваяСтрока.КодДокумента = "Template";
	НоваяСтрока.ТипРегламента = Перечисления.ТипыРегламентовЭДО.Черновик;
	НоваяСтрока.ТипДокумента = Перечисления.ТипыДокументовЭДО.ПустаяСсылка();
КонецПроцедуры

// Возвращаемое значение:
//  Структура:
// * Идентификатор - Строка - идентификатор черновика. Должен быть указан в описании документа,
//                            созданного в ответ на Черновик.
// * Тип - Строка - тип технологии роуминга или type Name Такском.
// * ОжидаетсяИзвещениеОПолучении - Булево - отправитель черновика ожидает УС (1999). Значение по умолчанию: false.
// * ДействителенС - Дата
// * ДействителенПо - Дата
// * ПолучательДокумента - Строка - на случай если отправитель черновика не является получателем ответа на Черновик.
// * ПлательщикДокумента - Строка - есть в рабочих переписках, в версии РГ - нет. Тот, кто будет оплачивать документ
//                                  по черновику. Сейчас в 1С всегда платит отправитель документа.
// * МаксимальноеКоличествоОтветов - Число - на первом этапе всегда 1.
// * РедактируемыеДанные - Массив из Строка - xpath строки доступных для редактирования полей.
Функция НовыеДанныеЧерновика() Экспорт
	Результат = Новый Структура;
	Результат.Вставить("Идентификатор", "");
	Результат.Вставить("Тип", "");
	Результат.Вставить("ОжидаетсяИзвещениеОПолучении", Ложь);
	Результат.Вставить("ДействителенС", Дата(1, 1, 1));
	Результат.Вставить("ДействителенПо", Дата(1, 1, 1));
	Результат.Вставить("ПолучательДокумента", "");
	Результат.Вставить("ПлательщикДокумента", "");
	Результат.Вставить("МаксимальноеКоличествоОтветов", 1);
	Результат.Вставить("РедактируемыеДанные", Новый Массив);
	Возврат Результат;
КонецФункции

// Параметры:
//  ДанныеЧерновика - Неопределено - возвращаемый параметр, если данные черновика есть в дополнительных параметрах карточки
//                                   возвращается структура. См. НовыеДанныеЧерновика
//  ДополнительныеПараметры - Структура
// @skip-check statement-type-change,property-return-type
Процедура ЗаполнитьДанныеЧерновикаПоДаннымДополнительныхПараметровКарточкиДокумента(ДанныеЧерновика,
	Знач ДополнительныеПараметры) Экспорт
	
	ОписаниеТипаЧисло = ОбщегоНазначения.ОписаниеТипаЧисло(2);
	ОписаниеТипаБулево = Новый ОписаниеТипов("Булево");
	
	ДанныеЧерновика = НовыеДанныеЧерновика();
	ДанныеЧерновика.Идентификатор = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДополнительныеПараметры, 
		"ШаблонИдентификатор", "");
	ДанныеЧерновика.Тип = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДополнительныеПараметры, 
		"ШаблонТип", "");
		
	Если ДополнительныеПараметры.Свойство("ШаблонОжидаетсяИзвещениеОПолучении")
		И ЗначениеЗаполнено(ДополнительныеПараметры.ШаблонОжидаетсяИзвещениеОПолучении) Тогда
		ДанныеЧерновика.ОжидаетсяИзвещениеОПолучении = ОписаниеТипаБулево.ПривестиЗначение(
			ДополнительныеПараметры.ШаблонОжидаетсяИзвещениеОПолучении);
	КонецЕсли;
	
	Если ДополнительныеПараметры.Свойство("ШаблонДействителенС")
		И ЗначениеЗаполнено(ДополнительныеПараметры.ШаблонДействителенС) Тогда
		ДанныеЧерновика.ДействителенС = XMLЗначение(Тип("Дата"), ДополнительныеПараметры.ШаблонДействителенС);
	КонецЕсли;
	
	Если ДополнительныеПараметры.Свойство("ШаблонДействителенПо")
		И ЗначениеЗаполнено(ДополнительныеПараметры.ШаблонДействителенПо) Тогда 
		ДанныеЧерновика.ДействителенПо = XMLЗначение(Тип("Дата"), ДополнительныеПараметры.ШаблонДействителенПо);
	КонецЕсли;
	
	ДанныеЧерновика.ПолучательДокумента = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДополнительныеПараметры, 
		"ШаблонПолучательДокумента", "");
	ДанныеЧерновика.ПлательщикДокумента = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДополнительныеПараметры, 
		"ШаблонПлательщикДокумента", "");
	
	Если ДополнительныеПараметры.Свойство("ШаблонМаксимальноеКоличествоОтветов")
		И ЗначениеЗаполнено(ДополнительныеПараметры.ШаблонМаксимальноеКоличествоОтветов) Тогда
		ДанныеЧерновика.МаксимальноеКоличествоОтветов = ОписаниеТипаЧисло.ПривестиЗначение(
			ДополнительныеПараметры.ШаблонМаксимальноеКоличествоОтветов);
	КонецЕсли;
	
	ДанныеЧерновика.РедактируемыеДанные = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДополнительныеПараметры, 
		"ШаблонРедактируемыеДанные", ДанныеЧерновика.РедактируемыеДанные);
	
КонецПроцедуры

#КонецОбласти // ТранспортныеКонтейнерыЭДО

#Область ЭлектронныеДокументыЭДО

// Возвращаемое значение:
//  Структура:
// * Идентификатор - Строка
// * ЭлектронныйДокументИсточник - ДокументСсылка.ЭлектронныйДокументИсходящийЭДО
// * ВидЧерновика - СправочникСсылка.ВидыДокументовЭДО
// * ОтправительЧерновика - Неопределено,ОпределяемыйТип.УчастникЭДО
// * ОтправительДляДокумента - Неопределено,ОпределяемыйТип.УчастникЭДО
// * ПолучательДляДокумента - Неопределено,ОпределяемыйТип.УчастникЭДО
// * РедактируемыеПоля - Массив из Строка
Функция НовыеПараметрыЧерновикаДокументаДляЗагрузки() Экспорт
	Параметры = Новый Структура;
	Параметры.Вставить("Идентификатор", "");
	Параметры.Вставить("ЭлектронныйДокументИсточник", Документы.ЧерновикЭлектронногоДокументаЭДО.ПустаяСсылка());
	Параметры.Вставить("ВидЧерновика", Справочники.ВидыДокументовЭДО.ПустаяСсылка());
	Параметры.Вставить("ОтправительЧерновика", Неопределено);
	Параметры.Вставить("ОтправительДляДокумента", Неопределено);
	Параметры.Вставить("ПолучательДляДокумента", Неопределено);
	Параметры.Вставить("РедактируемыеПоля", Новый Массив);
	Возврат Параметры;
КонецФункции

// Параметры:
//  ПараметрыЧерновика - Неопределено - возвращаемый параметр. См. НовыеПараметрыЧерновикаДокументаДляЗагрузки
//  ДанныеОбъекта - СтрокаТаблицыЗначений из См. СинхронизацияЭДО.НовыеДанныеОбъектов
// @skip-check statement-type-change,property-return-type,variable-value-type
Процедура ЗаполнитьПараметрыЧерновикаДокумента(ПараметрыЧерновика, Знач ДанныеОбъекта) Экспорт
	
	Карточка = ДанныеОбъекта.Карточка;
	
	ДанныеЧерновика = Неопределено; // См. НовыеДанныеЧерновика
	Если Карточка = Неопределено
		Или Не Карточка.Свойство("ДанныеЧерновика", ДанныеЧерновика)
		Или ДанныеЧерновика = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	СодержаниеДокумента = ДанныеОбъекта.Содержание;
	
	ПараметрыЧерновика = НовыеПараметрыЧерновикаДокументаДляЗагрузки();
	ПараметрыЧерновика.Идентификатор = ДанныеЧерновика.Идентификатор;
	ПараметрыЧерновика.ВидЧерновика = ДанныеОбъекта.ВидДокумента;
	
	ТипДокументаИзСодержания = Перечисления.ТипыДокументовЭДО.Прочее;
	Если СодержаниеДокумента <> Неопределено
		И СодержаниеДокумента.ТипДокумента <> Перечисления.ТипыДокументовЭДО.Черновик Тогда
		ТипДокументаИзСодержания = СодержаниеДокумента.ТипДокумента;
	КонецЕсли;
	ПараметрыЧерновика.ВидЧерновика = ЭлектронныеДокументыЭДО.ВидДокументаПоТипу(ТипДокументаИзСодержания);
	
	ПараметрыЧерновика.ОтправительЧерновика =
		УчетныеЗаписиЭДО.ОрганизацияУчетнойЗаписи(ДанныеОбъекта.ИдентификаторОтправителя);
	Если Не ЗначениеЗаполнено(ПараметрыЧерновика.ОтправительЧерновика) Тогда
		ПараметрыЧерновика.ОтправительЧерновика = ДанныеОбъекта.Контрагент;
	КонецЕсли;
	ПараметрыЧерновика.ОтправительДляДокумента = ДанныеОбъекта.Контрагент;
	ПараметрыЧерновика.ПолучательДляДокумента = ДанныеОбъекта.Организация;
	
	ОбщегоНазначенияКлиентСервер.ДополнитьМассив(ПараметрыЧерновика.РедактируемыеПоля, ДанныеЧерновика.РедактируемыеДанные);
	
КонецПроцедуры

// Параметры:
//  ПараметрыСоздания - См. НовыеПараметрыЧерновикаДокументаДляЗагрузки
// 
// Возвращаемое значение:
//  ДокументОбъект.ЧерновикЭлектронногоДокументаЭДО
//@skip-check variable-value-type
Функция СоздатьЧерновикДокументаЭДО(ПараметрыСоздания) Экспорт
	
	ЧерновикОбъект = Документы.ЧерновикЭлектронногоДокументаЭДО.СоздатьДокумент();
	ЗаполнитьЗначенияСвойств(ЧерновикОбъект, ПараметрыСоздания);
	Для Каждого РедактируемоеПоле Из ПараметрыСоздания.РедактируемыеПоля Цикл
		НоваяСтрока = ЧерновикОбъект.РедактируемыеПоля.Добавить();
		НоваяСтрока.Поле = РедактируемоеПоле;
	КонецЦикла;
	ЧерновикОбъект.Записать();
	
	Возврат ЧерновикОбъект;
	
КонецФункции

// Параметры:
//  СвойстваДокумента - См. ЧерновикиЭДОКлиентСервер.НовыеСвойстваДокументаДляПолученияПредставленияЧерновика
// 
// Возвращаемое значение:
//  Строка
Функция ПредставлениеЧерновика(СвойстваДокумента) Экспорт
	ПредставлениеДокумента = СтрШаблон(НСтр("ru = '%1 № %2 от %3'"), Строка(СвойстваДокумента.ВидЧерновика),
		СвойстваДокумента.НомерДокумента, Формат(СвойстваДокумента.ДатаДокумента, "ДЛФ=D;"));
	
	ПредставлениеДокументаРП = ПолучитьСклоненияСтроки(ПредставлениеДокумента, "L=ru_RU", "CS=Genitive;")[0];
	Возврат СтрШаблон(НСтр("ru='Черновик %1'"), ПредставлениеДокументаРП);
КонецФункции

// Параметры:
//  СообщениеОбъект - ДокументОбъект.СообщениеЭДО
Процедура ПриЗагрузкеСообщенияУжеСозданногоДокумента(СообщениеОбъект) Экспорт
	
	Если СообщениеОбъект.ТипЭлементаРегламента = Перечисления.ТипыЭлементовРегламентаЭДО.УС_ОтзывЧерновика Тогда
		УстановитьПометкуОтзываЧерновикаДокумента(СообщениеОбъект.ЭлектронныйДокумент);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти // ЭлектронныеДокументыЭДО

#Область ИнтерфейсДокументовЭДО

// Параметры:
//  Черновик - ДокументСсылка.ЧерновикЭлектронногоДокументаЭДО
// 
// Возвращаемое значение:
//  ПеречислениеСсылка.ТипыДокументовЭДО
Функция ТипДокументаЧерновика(Черновик) Экспорт
	
	РеквизитыЧерновика = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Черновик, "ВидЧерновика.ТипДокумента");
	//@skip-check property-return-type
	Возврат РеквизитыЧерновика.ВидЧерновикаТипДокумента;
	
КонецФункции

// Параметры:
//  КомандаВидна - Булево - выходной, переопределяемый параметр
//  ТипДокументаЧерновика - ПеречислениеСсылка.СостоянияДокументовЭДО
Процедура ПриОпределенииВидимостиКомандыСозданияДокументаНаОснованииЧерновика(КомандаВидна,
	Знач ТипДокументаЧерновика) Экспорт

	КомандаВидна = Ложь;
	
	Если ОбщегоНазначения.ПодсистемаСуществует("ЭлектронноеВзаимодействие.ОбменСГИСЭПД") Тогда
		МодульОбменСГИСЭПД = ОбщегоНазначения.ОбщийМодуль("ОбменСГИСЭПД");
		МодульОбменСГИСЭПД.ПриОпределенииВидимостиКомандыСозданияДокументаНаОснованииЧерновика(
			КомандаВидна, ТипДокументаЧерновика);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти // ИнтерфейсДокументовЭДО

#КонецОбласти // ДляВызоваИзДругихПодсистем

// Параметры:
//  Ссылка - ОпределяемыйТип.ОснованияЭлектронныхДокументовЭДО
// 
// Возвращаемое значение:
//  Булево
Функция ЭтоЧерновик(Ссылка) Экспорт
	
	ДопустимыеТипы = Новый Массив(2);
	ДопустимыеТипы[0] = Тип("ДокументСсылка.ЭлектронныйДокументВходящийЭДО");
	ДопустимыеТипы[1] = Тип("ДокументСсылка.ЭлектронныйДокументИсходящийЭДО");
	
	ТипСсылки = ТипЗнч(Ссылка);
	Если ДопустимыеТипы.Найти(ТипСсылки) = Неопределено Тогда
		Возврат Ложь;
	КонецЕсли;
	
	ЭтоЧерновик = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Ссылка, "ЭтоЧерновик");
	Возврат ЭтоЧерновик;
	
КонецФункции

// Возвращаемое значение:
//  Строка - строка длиной 32 символа
Функция НовыйИдентификаторЧерновика() Экспорт
	
	Возврат СтрЗаменить(Строка(Новый УникальныйИдентификатор()), "-", "");
	
КонецФункции

// Параметры:
//  ЧерновикОснование - ДокументСсылка.ЧерновикЭлектронногоДокументаЭДО
//  КонтекстДиагностики - См. ОбработкаНеисправностейБЭД.НовыйКонтекстДиагностики
Процедура ПослеСозданияЭлектронногоДокументаПоЧерновику(ЧерновикОснование, КонтекстДиагностики) Экспорт
	
	УстановитьПометкуОбработан(ЧерновикОснование);
	ЗавершитьОбменДляДокументаИсточникаЧерновика(ЧерновикОснование, КонтекстДиагностики);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Параметры:
//  ЭлектронныйДокумент - ДокументСсылка.ЭлектронныйДокументВходящийЭДО
//                      - ДокументСсылка.ЭлектронныйДокументИсходящийЭДО
Процедура УстановитьПометкуОтзываЧерновикаДокумента(ЭлектронныйДокумент)

	Черновик = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ЭлектронныйДокумент, "ЧерновикОснование");
	
	Если Не ЗначениеЗаполнено(Черновик) Тогда
		Возврат;
	КонецЕсли;
	
	НачатьТранзакцию();
	
	Попытка
		
		ЧерновикОбъект = ОбщегоНазначенияБЭД.ОбъектПоСсылкеДляИзменения(Черновик);
		ЧерновикОбъект.Отозван = Истина;
		ЧерновикОбъект.Записать();
		
		ЗафиксироватьТранзакцию();
		
	Исключение
		
		ОтменитьТранзакцию();
		
		Операция = НСтр("ru = 'Установка пометки отзыва черновика электронного документа'");
		ПодробныйТекстОшибки = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ТекстСообщения = НСтр("ru = 'Не удалось установить пометку отзыва черновика электронного документа.
			|Подробности в журнале регистрации'");
		ОбработкаНеисправностейБЭД.ОбработатьОшибку(Операция,
			ОбщегоНазначенияБЭДКлиентСервер.ПодсистемыБЭД().ОбменСКонтрагентами,
			ПодробныйТекстОшибки, ТекстСообщения, Черновик);
		
	КонецПопытки;

КонецПроцедуры

// Параметры:
//  Черновик - ДокументСсылка.ЧерновикЭлектронногоДокументаЭДО
Процедура УстановитьПометкуОбработан(Черновик)
	
	НачатьТранзакцию();
	
	Попытка
		
		ЧерновикОбъект = ОбщегоНазначенияБЭД.ОбъектПоСсылкеДляИзменения(Черновик);
		ЧерновикОбъект.Обработан = Истина;
		ЧерновикОбъект.Записать();
		
		ЗафиксироватьТранзакцию();
		
	Исключение
		
		ОтменитьТранзакцию();
		
		Операция = НСтр("ru = 'Установка признака обработки черновика электронного документа'");
		ПодробныйТекстОшибки = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ТекстСообщения = НСтр("ru = 'Не удалось установить пометку обработки черновика электронного документа.
			|Подробности в журнале регистрации'");
		ОбработкаНеисправностейБЭД.ОбработатьОшибку(Операция,
			ОбщегоНазначенияБЭДКлиентСервер.ПодсистемыБЭД().ОбменСКонтрагентами,
			ПодробныйТекстОшибки, ТекстСообщения, Черновик);
		
	КонецПопытки;

КонецПроцедуры

// Параметры:
//  Черновик - ДокументСсылка.ЧерновикЭлектронногоДокументаЭДО
//  КонтекстДиагностики - См. ОбработкаНеисправностейБЭД.НовыйКонтекстДиагностики
Процедура ЗавершитьОбменДляДокументаИсточникаЧерновика(Черновик, КонтекстДиагностики)
	
	ДокументИсточник = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Черновик, "ЭлектронныйДокументИсточник");
	
	Если Не ЗначениеЗаполнено(ДокументИсточник) Тогда
		Возврат;
	КонецЕсли;
	
	Действие = Перечисления.ДействияПоЭДО.СоздатьДокументПоЧерновику;
	
	ЭлектронныеДокументыЭДОСлужебный.ОбновитьСостояниеДокументаПоДействию(ДокументИсточник, Действие,
		КонтекстДиагностики);
	
КонецПроцедуры

#КонецОбласти
